-- Вставка данных в таблицу departments
INSERT INTO departments (department_id, department_name, local_phone_number, public_phone_number)
VALUES
    (1, 'Кардиология', '1001', '89234567890'),
    (2, 'Неврология', '1002', '89234567891'),
    (3, 'Педиатрия', '1003', '89234567892'),
    (4, 'Хирургия', '1004', '89234567893'),
    (5, 'Онкология', '1005', '89234567894'),
    (6, 'Гинекология', '1006', '89234567895'),
    (7, 'Дерматология', '1007', '89234567896'),
    (8, 'Эндокринология', '1008', '89234567897'),
    (9, 'Гастроэнтерология', '1009', '89234567898'),
    (10, 'Пневмология', '1010', '89234567899'),
    (11, 'Диагностика', '1011', '89234567900'),
    (12, 'Патологоанатомия', '1012', '89234567901'),
    (13, 'Психиатрия', '1013', '89234567902');

-- Вставка данных в таблицу doctors
INSERT INTO doctors (first_name, last_name, patronymic, position, department_id)
VALUES
    ('Иван', 'Иванов', 'Иванович', 'Кардиолог', 1),
    ('Анна', 'Смирнова', 'Алексеевна', 'Невролог', 2),
    ('Пётр', 'Петров', 'Петрович', 'Педиатр', 3),
    ('Елена', 'Кузнецова', 'Сергеевна', 'Хирург', 4),
    ('Сергей', 'Морозов', 'Александрович', 'Онколог', 5),
    ('Мария', 'Волкова', 'Ивановна', 'Гинеколог', 6),
    ('Алексей', 'Соколов', 'Петрович', 'Дерматолог', 7),
    ('Ольга', 'Лебедева', 'Владимировна', 'Эндокринолог', 8),
    ('Дмитрий', 'Козлов', 'Алексеевич', 'Гастроэнтеролог', 9),
    ('Наталья', 'Новикова', 'Сергеевна', 'Пульмонолог', 10),
    ('Грегори', 'Хаус', NULL, 'Диагност', 11),
    ('Стивен', 'Стрэндж', NULL, 'Хирург', 4),
    ('Андрей', 'Быков', NULL, 'Терапевт', 11),
    ('Семён', 'Лобанов', NULL, 'Кардиолог', 1),
    ('Шон', 'Мёрфи', NULL, 'Патологоанатом', 12),
    ('Ганнибал', 'Лектор', NULL, 'Психиатр', 13);

-- Вставка данных в таблицу rooms
INSERT INTO rooms (department_id, room_number, room_name, room_type)
VALUES
    (1,  '101', 'Кабинет 101', 'examination'),
    (2,  '102', 'Кабинет 102', 'examination'),
    (3,  '103', 'Кабинет 103', 'examination'),
    (4,  '104', 'Кабинет 104', 'examination'),
    (5,  '105', 'Кабинет 105', 'examination'),
    (6,  '106', 'Кабинет 106', 'examination'),
    (7,  '107', 'Кабинет 107', 'examination'),
    (8,  '108', 'Кабинет 108', 'examination'),
    (9,  '109', 'Кабинет 109', 'examination'),
    (10, '110', 'Кабинет 110', 'examination');

INSERT INTO rooms (department_id, room_number, room_name, room_type, number_of_beds)
VALUES
    (1,  '201', 'Палата 201', 'ward', 8),
    (5,  '205', 'Палата 205', 'ward', 6);


-- Вставка данных в таблицу patients
INSERT INTO patients (first_name, last_name, patronymic, birth_date, gender, phone_number)
VALUES
    ('Иван', 'Иванов', 'Иванович', '1980-05-15', 'male', '89234567890'),
    ('Анна', 'Смирнова', 'Алексеевна', '1990-08-20', 'female', '89987654321'),
    ('Пётр', 'Петров', 'Петрович', '1975-12-01', 'male', '89122334455'),
    ('Елена', 'Кузнецова', 'Сергеевна', '2000-07-10', 'female', '89233445566'),
    ('Сергей', 'Морозов', 'Александрович', '1985-11-25', 'male', '89344556677'),
    ('Мария', 'Волкова', 'Ивановна', '1995-03-05', 'female', '89455667788'),
    ('Алексей', 'Соколов', 'Петрович', '1970-02-28', 'male', '89566778899'),
    ('Ольга', 'Лебедева', 'Владимировна', '1988-06-15', 'female', '89677889900'),
    ('Дмитрий', 'Козлов', NULL, '2003-01-01', 'male', '89788990011'),
    ('Наталья', 'Новикова', 'Сергеевна', '1993-09-09', 'female', '89899001122');

-- Вставка данных в таблицу diagnoses
INSERT INTO diagnoses (diagnosis_name, doctor_id, patient_id)
VALUES
    ('Гипертония', 1, 1),
    ('Аппендицит', 2, 2),
    ('Грипп', 3, 3),
    ('Аритмия', 4, 4),
    ('Анемия', 5, 5),
    ('Депрессия', 6, 6),
    ('Сахарный диабет', 7, 7),
    ('Желчнокаменная болезнь', 8, 8),
    ('Синусит', 9, 9),
    ('Сердечная недостаточность', 10, 10);

-- Вставка данных в таблицу visits
INSERT INTO visits (visit_date, patient_id, doctor_id, diagnosis_id)
VALUES
    ('2024-01-15', 1, 1, 1),
    ('2024-02-20', 2, 2, 2),
    ('2024-03-12', 3, 3, 3),
    ('2024-04-05', 4, 4, 4),
    ('2024-05-10', 5, 5, 5),
    ('2024-06-18', 6, 6, 6),
    ('2024-07-01', 7, 7, 7),
    ('2024-08-09', 8, 8, 8),
    ('2024-09-14', 9, 9, 9),
    ('2024-10-22', 10, 10, 10);

-- Вставка данных в таблицу medications
INSERT INTO medications (medication_name, indications, form, production_date, expiration_date, price, amount)
VALUES
    ('Аспирин', 'Противовоспалительное', 'Таблетка', '2023-01-01', '2025-12-31', 375.00, 100),
    ('Парацетамол', 'Обезболивающее', 'Сироп', '2023-02-01', '2026-06-30', 295.00, 200),
    ('Метформин', 'Сахароснижающее', 'Таблетка', '2023-03-01', '2024-11-30', 550.00, 150),
    ('Ибупрофен', 'Противовоспалительное', 'Капсула', '2023-04-01', '2025-03-31', 389.00, 120),
    ('Амоксициллин', 'Антибиотик', 'Таблетка', '2023-05-01', '2026-08-15', 765.0, 180),
    ('Циталопрам', 'Антидепрессант', 'Таблетка', '2023-06-01', '2027-05-10', 890.0, 250),
    ('Аторвастатин', 'Статин', 'Таблетка', '2023-07-01', '2025-01-01', 924.00, 220),
    ('Омепразол', 'Ингибитор протонной помпы', 'Капсула', '2023-08-01', '2024-12-15', 649.50, 280),
    ('Фуросемид', 'Диуретик', 'Инъекция', '2023-09-01', '2026-03-20', 429.99, 300),
    ('Лизиноприл', 'Ингибитор АПФ', 'Таблетка', '2023-10-01', '2025-07-01', 345.55, 350);   

-- Вставка данных в таблицу treatment_courses
INSERT INTO treatment_courses (visit_id, medication_id, treatment_description, dosage_mg, times_per_day)
VALUES
    (1, 1, 'Принимать 1 таблетку 1 раз в день', 500, 1),
    (2, 2, 'Принимать 10 мл 3 раза в день', 10, 3),
    (3, 3, 'Принимать 2 таблетки 2 раза в день', 850, 2),
    (4, 4, 'Принимать 3 капсулы 3 раза в день', 600, 3),
    (5, 5, 'Принимать 5 таблеток 2 раза в день', 500, 2),
    (6, 6, 'Принимать 20 мг 1 раз в день', 20, 1),
    (7, 7, 'Принимать 1 таблетку 1 раз в день', 10, 1),
    (8, 8, 'Принимать 2 капсулы 2 раза в день', 40, 2),
    (9, 9, 'Принимать 1 инъекцию 2 раза в день', 20, 2),
    (10, 10, 'Принимать 2 таблетки 1 раз в день', 20, 1);

-- Вставка данных в таблицу visits_diagnoses
INSERT INTO visits_diagnoses (visit_id, diagnosis_id)
VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5),
    (6, 6),
    (7, 7),
    (8, 8),
    (9, 9),
    (10, 10);

-- Вставка данных в таблицу visits_rooms
INSERT INTO visits_rooms (visit_id, room_id, admission_date, discharge_date)
VALUES
    (1, 1, '2024-01-15', NULL),
    (2, 2, '2024-02-20', NULL),
    (3, 3, '2024-03-12', NULL),
    (4, 4, '2024-04-05', NULL),
    (5, 5, '2024-05-10', NULL),
    (6, 6, '2024-06-18', NULL),
    (7, 7, '2024-07-01', NULL),
    (8, 8, '2024-08-09', NULL),
    (9, 9, '2024-09-14', NULL),
    (10, 10, '2024-10-22', NULL);
